<%@ Page Language="C#" AutoEventWireup="true" CodeBehind="wx_article_list.aspx.cs" Inherits="DB.Web.wx_article_list" %>

<!DOCTYPE html>

<html lang="zh-CN">
<head runat="server">
<meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no">
    
    <meta name="format-detection" content="telephone=no">
    <meta name="format-detection" content="email=no"/>
    <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

	<title>mutuus F.A.Q</title>

    <meta name="keywords" content="">
    <meta name="description" content="">

    <link href="https://res.wx.qq.com/open/libs/weui/1.1.0/weui.min.css" rel="stylesheet">
    <link href="css/wx_mutuus.css" rel="stylesheet">
   

    <script src="js/jquery.1.11.0.min.js"></script>
</head>
<body>
    <form id="form1" runat="server" class="page__form">

<div class="container" id="container">
<div class="page home js_show">
    <div class="page__hd">
        <h1 class="page__title page__title-text clearfix">

<!-- <svg version="1.1" id="faq" x="0px" y="0px" viewBox="0 0 200 60" xml:space="preserve">
<path d="M0,1.5h40v11.2H16.2v9.1h20.3v10.6H16.2v21.4H0V1.5z"/>
<path d="M36.6,39.2h15.5v14.6H36.6V39.2z"/>
<path d="M108.3,46.1c2,1.4,3.3,2.3,4,2.6c0.9,0.5,2.2,1.1,3.7,1.8l-4.5,9.1c-2.3-1.1-4.5-2.4-6.7-3.9s-3.8-2.6-4.6-3.4
    c-3.6,1.5-8,2.3-13.4,2.3c-7.9,0-14.2-2.1-18.8-6.2c-5.4-4.9-8.1-11.8-8.1-20.7c0-8.6,2.4-15.3,7.1-20.1C71.7,3,78.3,0.6,86.8,0.6
    c8.7,0,15.4,2.3,20.1,7c4.7,4.7,7.1,11.3,7.1,20C114,35.3,112.1,41.5,108.3,46.1z M95.9,37.9c1.3-2.3,1.9-5.8,1.9-10.3
    c0-5.3-1-9.1-2.9-11.3s-4.7-3.4-8.1-3.4c-3.2,0-5.8,1.2-7.8,3.5s-3,5.9-3,10.8c0,5.7,1,9.7,2.9,12s4.6,3.5,8,3.5
    c1.1,0,2.1-0.1,3.1-0.3c-1.4-1.3-3.5-2.5-6.4-3.7l2.5-5.8c1.4,0.3,2.5,0.6,3.3,1c0.8,0.4,2.3,1.4,4.7,3
    C94.7,37.1,95.3,37.5,95.9,37.9z"/>
<path d="M123,39.2h15.5v14.6H123V39.2z"/>
<path d="M180.5,45.1h-18.3l-2.6,8.6h-16.5l19.7-52.3h17.6L200,53.8h-16.9L180.5,45.1z M177.1,33.8L171.3,15l-5.7,18.8H177.1z"/>
</svg> -->
<svg version="1.1" id="fqa" x="0px" y="0px" viewBox="0 0 155 60" >
<g>
    <polygon points="17.3,12.5 41.3,12.5 41.3,1.1 0.9,1.1 0.9,54 17.3,54 17.3,32.4 37.8,32.4 37.8,21.8 17.3,21.8    "/>
    <path d="M57.7,1.1L37.8,54h16.7l2.6-8.7h18.6l2.6,8.7h17.1L75.5,1.1H57.7z M60.6,33.9l5.8-19l5.8,19H60.6z"/>
    <path d="M150.2,49c-0.6-0.4-2-1.3-4-2.7c3.8-4.7,5.8-10.9,5.8-18.8c0-8.8-2.4-15.5-7.2-20.2c-4.8-4.7-11.6-7.1-20.3-7.1
        c-8.6,0-15.3,2.4-20.1,7.2c-4.8,4.8-7.2,11.6-7.2,20.3c0,9,2.7,15.9,8.2,20.9c4.6,4.2,11,6.3,19,6.3c5.4,0,10-0.8,13.6-2.3
        c0.9,0.8,2.5,1.9,4.7,3.4c2.2,1.5,4.5,2.8,6.8,4l4.5-9.2C152.4,50.1,151.1,49.5,150.2,49z M133.6,38c-0.6-0.4-1.3-0.8-1.8-1.2
        c-2.3-1.6-3.9-2.6-4.7-3s-1.9-0.7-3.4-1l-2.6,5.9c3,1.2,5.1,2.4,6.5,3.8c-1,0.2-2,0.3-3.1,0.3c-3.4,0-6.1-1.2-8.1-3.5
        c-2-2.3-3-6.4-3-12.2c0-5,1-8.6,3-10.9c2-2.3,4.7-3.5,7.9-3.5c3.5,0,6.2,1.1,8.2,3.4c2,2.3,3,6.1,3,11.4
        C135.6,32.1,134.9,35.6,133.6,38z"/>
</g>
</svg>

<!-- <svg version="1.1" id="logo" x="0px" y="0px" viewBox="0 0 200 200" >
<g>
    <circle class="st0" cx="85.1" cy="150" r="3.2"/>
    <path class="st0" d="M110.7,160.9c-0.5,0-1,0.3-1.2,0.8l0,0c0,0,0,0,0,0c-1.7,3.5-5.3,6-9.4,6c-2.8,0-5.4-1.1-7.3-2.9l0,0
        c0,0-0.3-0.4-0.9-0.4c-0.7,0-1.3,0.6-1.3,1.3c0,0.4,0.4,0.9,0.4,0.9c2.3,2.3,5.6,3.7,9.1,3.7c5.2,0,9.7-3.1,11.8-7.5l0,0
        c0.1-0.2,0.1-0.4,0.1-0.6C112,161.4,111.4,160.9,110.7,160.9z"/>
    <path class="st0" d="M99.7,1.5c-47.5,0-74.7,31-85.4,49.1c0,0-3.6,5.9-6,13.8c-2,6.5-3,14.5-3,20.1c0,25.5,14.1,47.6,34.7,58.8
        c0.6,8.4,2.1,13,6.2,20.8c0.1,0.1,0.1,0.3,0.2,0.4c0,0,0,0,0,0l0,0c0.5,0.7,1.2,1.1,2.1,1.1c1.4,0,2.5-1.1,2.5-2.5
        c0-0.5-0.2-1-0.5-1.5l0,0c-3.9-7.9-4.8-11.6-5.4-21.1c-13.9-6-22.7-15.3-27.8-23.9c-3.7-6.3-6.5-11.3-8.1-17C8.2,95,7,89.9,7,83.7
        C7,76,7.8,69.6,9.6,63.2c2.1-7.3,5-12.1,5.2-12.4c0,0,0.1-0.1,0.1-0.1c5.1,0.6,11.9,3.2,14.6,9.7c8.6,20.7,23,37.3,33.7,45.6
        c11,8.5,20.6,14.3,31.6,18.4c0,1.3,0,4.1,2.7,7.8c3.8,4.8,6,16.1,0.2,23.8c7.9-3.5,16.8-13.1,17.4-26.6c3.2,2.4,11.9,9.5,11.9,23.1
        c0.3,14.2-11.2,28.3-28.3,28.3c-17.2,0-28.3-14.1-28.3-28.3c-5.4,0.7-12.9,5.2-12.9,14.9c0,5.2,2.4,8.9,5.3,11.3
        c-7.5,5.9-15.8,5-22.3,0.6c3.2,2.3,11.4,8.2,21.4,12.2c9.5,3.9,21.7,7.6,40.7,7.6c42.3,0,96-36.3,96-98.7
        C198.4,43.1,151.8,1.5,99.7,1.5z M106.1,91c0,1.2-1,2.1-2.1,2.1c-1,0-1.8-0.6-2-1.5c0,0-0.8-2.5-3.4-2.5c-1.6,0-2.6,1.1-2.6,1.1
        c-0.4,0.4-0.9,0.6-1.5,0.6c-1.2,0-2.1-1-2.1-2.1c0-0.6,0.2-1.1,0.6-1.5c0,0,0.1-0.1,0.1-0.1c1.6-1.6,3.4-2.4,5.6-2.4
        c3.6,0,6.5,2.3,7.5,5.5C106.1,90.6,106.1,90.7,106.1,91z"/>
</g>
</svg> -->

<svg version="1.1" id="logo-en" x="0px" y="0px"
     viewBox="0 0 200 200" xml:space="preserve">
<g>
    <circle class="st0" cx="89.5" cy="106.8" r="2.3"/>
    <path class="st0" d="M107.9,114.6c-0.4,0-0.7,0.2-0.8,0.6l0,0c0,0,0,0,0,0c-1.2,2.5-3.8,4.3-6.8,4.3c-2,0-3.9-0.8-5.2-2.1l0,0
        c0,0-0.2-0.3-0.7-0.3c-0.5,0-0.9,0.4-0.9,0.9c0,0.3,0.3,0.7,0.3,0.7c1.7,1.6,4,2.7,6.5,2.7c3.8,0,7-2.2,8.5-5.4l0,0
        c0.1-0.1,0.1-0.3,0.1-0.4C108.8,115.1,108.4,114.6,107.9,114.6z"/>
    <path class="st0" d="M100,0.1c-34.2,0-53.7,22.3-61.4,35.3c0,0-2.6,4.2-4.3,9.9c-1.5,4.7-2.2,10.4-2.2,14.4
        c0,18.3,10.1,34.2,25,42.3c0.4,6,1.5,9.4,4.5,15c0,0.1,0.1,0.2,0.2,0.3c0,0,0,0,0,0l0,0c0.3,0.5,0.9,0.8,1.5,0.8
        c1,0,1.8-0.8,1.8-1.8c0-0.4-0.1-0.8-0.3-1l0,0c-2.8-5.7-3.5-8.3-3.9-15.2c-10-4.3-16.3-11-20-17.2c-2.7-4.6-4.7-8.1-5.8-12.2
        c-0.9-3.3-1.8-6.9-1.8-11.4c0-5.5,0.5-10.1,1.9-14.8c1.5-5.2,3.6-8.7,3.7-8.9c0,0,0-0.1,0-0.1c3.7,0.4,8.5,2.3,10.5,7
        C55.7,57.3,66,69.2,73.7,75.2c7.9,6.1,14.8,10.3,22.7,13.2c0,0.9,0,2.9,1.9,5.6c2.7,3.4,4.3,11.6,0.1,17.1
        c5.6-2.5,12.1-9.4,12.5-19.1c2.3,1.7,8.5,6.9,8.5,16.6c0.2,10.2-8,20.4-20.4,20.4c-12.3,0-20.4-10.1-20.4-20.4
        c-3.9,0.5-9.3,3.8-9.3,10.7c0,3.7,1.8,6.4,3.8,8.2c-5.4,4.3-11.4,3.6-16,0.4c2.3,1.6,8.2,5.9,15.4,8.8c6.8,2.8,15.6,5.5,29.3,5.5
        c30.4,0,69-26.1,69-71C171,30,137.5,0.1,100,0.1z M104.6,64.4c0,0.9-0.7,1.5-1.5,1.5c-0.7,0-1.3-0.5-1.5-1.1c0,0-0.6-1.8-2.4-1.8
        c-1.2,0-1.9,0.8-1.9,0.8c-0.3,0.3-0.7,0.4-1.1,0.4c-0.9,0-1.5-0.7-1.5-1.5c0-0.4,0.2-0.8,0.4-1.1c0,0,0,0,0,0
        c1.2-1.2,2.4-1.7,4-1.7c2.6,0,4.6,1.7,5.4,3.9C104.6,64.1,104.6,64.2,104.6,64.4z"/>
</g>
<g>
    <path class="st1" d="M44,168.8c-2.6-2.8-5.8-4.2-9.5-4.2c-4.4,0-7.9,1.7-10.5,5c-2.7-3.4-6.1-5-10.5-5c-3.7,0-6.9,1.4-9.5,4.2
        c-2.6,2.8-3.9,6.1-3.9,9.9c0,6.6,0,13.1,0,19.7c0,0.4,1.3,0.8,2.9,0.8c1.6,0,2.9-0.3,2.9-0.8c0-6.6,0-13.1,0-19.7
        c0-2.2,0.7-4.1,2.2-5.7c1.5-1.6,3.3-2.5,5.4-2.5c2.4,0,4.2,0.8,5.5,2.3c1.4,1.6,2.1,3.5,2.1,5.9c0,6.6,0,13.1,0,19.7
        c0,0.4,1.3,0.8,2.9,0.8c1.6,0,2.9-0.3,2.9-0.8c0-6.6,0-13.1,0-19.7c0-2.4,0.7-4.3,2.1-5.9c1.4-1.5,3.2-2.3,5.6-2.3
        c2.1,0,3.9,0.8,5.4,2.5c1.5,1.6,2.2,3.5,2.2,5.7c0,6.6,0,13.1,0,19.7c0,0.4,1.3,0.8,2.9,0.8c1.6,0,2.9-0.3,2.9-0.8
        c0-6.6,0-13.1,0-19.7C47.9,174.9,46.6,171.6,44,168.8z"/>
    <path class="st1" d="M104.3,193.7c-2.5-0.2-4.7-0.5-6.8-2c-1.9-1.5-3.1-3.8-3.1-6.3l0-14.6h8.7c0.4,0,0.8-1.3,0.8-2.9
        c0-1.6-0.3-2.9-0.8-2.9h-8.6v-10.1c0-0.4-1.3-0.8-2.9-0.8c-1.6,0-2.9,0.3-2.9,0.8c0,10.2,0,20.4,0,30.6c0,9.8,6.5,14.1,15.1,14.1
        c0,0,0,0,0,0c0.4,0,0.9-1.2,1-2.8C104.9,195,104.7,193.7,104.3,193.7z"/>
    <path class="st1" d="M196,182.1c-2.1-1.3-4.8-2.2-7.1-3.2c-2-0.9-4-2-4-4.4c0-1.1,0.5-2.1,1.4-2.9c0.9-0.8,1.7-1.4,2.9-1.4l9.8,0
        c0.4,0,0.8-1.2,0.8-2.7c0-1.5-0.3-2.8-0.8-2.8l-10,0c-0.5,0-1.1,0.1-1.6,0.2c-2,0.4-3.8,1.3-5.3,2.6c-4.3,3.9-4.3,11.5,0.8,14.9
        c0.6,0.4,1.3,0.6,1.9,0.9c2.8,1.3,9.2,3,9.2,6.7c0,2.8-2.8,4.4-5.4,4.3l-9.2,0c-0.4,0-0.8,1.2-0.8,2.8c0,1.5,0.3,2.8,0.8,2.8h8.7
        c3.6,0,6.3-0.6,8.9-3C201.3,193.1,201.1,185.5,196,182.1z"/>
    <path class="st1" d="M80.9,164.6c-1.6,0-2.9,0.3-2.9,0.8c0,6.6,0,13.2,0,19.8c0,2.6-0.9,4.8-2.8,6.6c-1.8,1.8-4,2.7-6.6,2.7
        c-2.6,0-4.8-0.9-6.6-2.7c-1.8-1.8-2.7-4-2.7-6.6c0-6.6,0-13.2,0-19.8c0-0.4-1.3-0.8-2.9-0.8c-1.6,0-2.9,0.3-2.9,0.8
        c0,6.6,0,13.2,0,19.8c0,4,1.5,7.5,4.6,10.6c3,3,6.6,4.6,10.6,4.6c4,0,7.5-1.5,10.6-4.6c3.1-3.1,4.6-6.6,4.6-10.6
        c0-6.6,0-13.2,0-19.8C83.8,164.9,82.5,164.6,80.9,164.6z"/>
    <path class="st1" d="M135.7,164.8c-1.6,0-2.9,0.3-2.9,0.8v4.2c0,0,0,0.1,0,0.1c0,6.7,0,8.8,0,15.5c0,2.6-0.9,4.8-2.8,6.6
        c-1.8,1.8-4,2.7-6.6,2.7c-2.6,0-4.8-0.9-6.6-2.7c-1.8-1.8-2.7-4-2.7-6.6c0-6.6,0-13.2,0-19.8c0-0.4-1.3-0.8-2.9-0.8
        c-1.6,0-2.9,0.3-2.9,0.8v4.3c0,0,0,0,0,0c0,6.7,0,8.8,0,15.5c0,4,1.5,7.5,4.6,10.6c3,3,6.6,4.6,10.6,4.6c4,0,7.5-1.5,10.6-4.6
        c3.1-3.1,4.6-6.6,4.6-10.6c0-6.6,0-13.2,0-19.8C138.6,165.1,137.3,164.8,135.7,164.8z"/>
    <path class="st1" d="M171.5,164.8c-1.6,0-2.9,0.3-2.9,0.8v4.2c0,0,0,0.1,0,0.1c0,6.7,0,8.8,0,15.5c0,2.6-0.9,4.8-2.8,6.6
        c-1.8,1.8-4,2.7-6.6,2.7c-2.6,0-4.8-0.9-6.6-2.7c-1.8-1.8-2.7-4-2.7-6.6c0-6.6,0-13.2,0-19.8c0-0.4-1.3-0.8-2.9-0.8
        c-1.6,0-2.9,0.3-2.9,0.8v4.3c0,0,0,0,0,0c0,6.7,0,8.8,0,15.5c0,4,1.5,7.5,4.6,10.6c3,3,6.6,4.6,10.6,4.6c4,0,7.5-1.5,10.6-4.6
        c3.1-3.1,4.6-6.6,4.6-10.6c0-6.6,0-13.2,0-19.8C174.5,165.1,173.1,164.8,171.5,164.8z"/>
</g>
</svg>
        </h1>

    </div>
    <div class="page__bd page__bd_spacing">
        <ul>
            <li class="js_show">      
                <div class="page__category js_categoryInner">
                    <div class="weui-cells page__category-content">
     <asp:Repeater ID="Repeater1" runat="server"  ><ItemTemplate>     
                        <a class="weui-cell weui-cell_access js_item" href="<%#Eval("wxurl")%>">
                            <div class="weui-cell__bd">
                                <p><%#Eval("wxaname")%></p>
                            </div>
                            <div class="weui-cell__ft"></div>
                        </a>
    </ItemTemplate></asp:Repeater>
                    </div>
                </div>
            </li>

        </ul>
    </div>
    <div class="page__ft j_bottom">
        <img src="./images/bg/logo-en-gray.png" width="80px">
    </div>
</div>
</div>


        

    </form>
</body>
    
<script src="https://res.wx.qq.com/open/js/jweixin-1.0.0.js"></script>
<script>
var wxAppid = 'wxf1b528cc436d1f15';
var wxTitle = 'mutuus F.A.Q';
var wxDesc = '关于mutuus，您所关心的问题都在这里。';
var wxLink = 'http://www.imutuus.com/wx_article_list.aspx';
var wxImgUrl = 'http://www.imutuus.com/images/bg/about_logo_2.gif';

  
wx.config({
      debug: false,
      appId: wxAppid,
      <%=GetSignature() %>,
     jsApiList: [
         'checkJsApi',
         'onMenuShareTimeline',
         'onMenuShareAppMessage',
         'onMenuShareQQ',
         'onMenuShareWeibo'
     ]
});
wx.ready(function () {
    wx.checkJsApi({
        jsApiList: [
            'onMenuShareTimeline',
            'onMenuShareAppMessage',
            'onMenuShareQQ',
        ]
    });

    wx.onMenuShareTimeline({
        title: wxTitle,
        desc: wxDesc,
        link: wxLink,
        imgUrl: wxImgUrl,
        trigger: function (res) {
            console.log('用户点击分享到朋友圈');
        },
        success: function (res) {
            alert('已分享');
        },
        cancel: function (res) {
            console.log('已取消');
        },
        fail: function (res) {
            console.log('wx.onMenuShareTimeline:fail: '+JSON.stringify(res));
        }
    });

    wx.onMenuShareAppMessage({
        title: wxTitle,
        desc: wxDesc,
        link: wxLink,
        imgUrl: wxImgUrl,
        trigger: function (res) {
           console.log('用户点击分给到朋友');
        },
        success: function (res) {
            alert('已分享');
        },
        cancel: function (res) {
            console.log('已取消');
        },
        fail: function (res) {
            console.log('wx.onMenuShareTimeline:fail: '+JSON.stringify(res));
        }
    });

    wx.onMenuShareQQ({
        title: wxTitle,
        desc: wxDesc,
        link: wxLink,
        imgUrl: wxImgUrl,
        success: function () { 
           console.log('已分享');
        },
        cancel: function () { 
           console.log('已取消');
        },
        fail: function (res) {
            console.log('wx.onMenuShareTimeline:fail: '+JSON.stringify(res));
        }
    });
 
});
wx.error(function (res) {
    console.log('wx.error: '+JSON.stringify(res));
});

    // function onBridgeReady() {
    //     WeixinJSBridge.invoke('hideOptionMenu');
    // }
    // if (typeof WeixinJSBridge == "undefined") {
    //     document.addEventListener('WeixinJSBridgeReady', onBridgeReady, false);
    // } else if (document.attachEvent) {
    //     document.attachEvent('WeixinJSBridgeReady', onBridgeReady);
    //     document.attachEvent('onWeixinJSBridgeReady', onBridgeReady);
    // } else {
    //     onBridgeReady();
    // }

    // $(function () {

    //     // 自定义链接
    //     $('.btndLink').on('touchstart', function (e) {
    //         var sLink = $(this).data('dlink');
    //         console.log(sLink);
    //         window.location.href = sLink;
    //     });

    // });
</script>
</html>
